newwms_gift/src/Enums/ТипыПодключаемогоОборудования/ТипыПодключаемогоОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПодключаемогоОборудования</name>
  <enumValues>
    <name>СканерШтрихкода</name>
    <comment>Scanner</comment>
  </enumValues>
  <enumValues>
    <name>СчитывательМагнитныхКарт</name>
    <comment>MSR</comment>
  </enumValues>
  <enumValues>
    <name>ККТ</name>
    <comment>KKT</comment>
  </enumValues>
  <enumValues>
    <name>ФискальныйРегистратор</name>
    <comment>FiscalPrinter</comment>
  </enumValues>
  <enumValues>
    <name>ПринтерЧеков</name>
    <comment>ReceiptPrinter</comment>
  </enumValues>
  <enumValues>
    <name>ДисплейПокупателя</name>
    <comment>LineDisplay</comment>
  </enumValues>
  <enumValues>
    <name>ТерминалСбораДанных</name>
    <comment>DataCollectionTerminal</comment>
  </enumValues>
  <enumValues>
    <name>ЭквайринговыйТерминал</name>
    <comment>AcquiringTerminal</comment>
  </enumValues>
  <enumValues>
    <name>ЭлектронныеВесы</name>
    <comment>Scale</comment>
  </enumValues>
  <enumValues>
    <name>ВесыСПечатьюЭтикеток</name>
    <comment>ScaleOffline</comment>
  </enumValues>
  <enumValues>
    <name>УдалитьККМОфлайн</name>
    <comment>ECROffline</comment>
  </enumValues>
  <enumValues>
    <name>ПринтерЭтикеток</name>
    <comment>LabelPrinter</comment>
  </enumValues>
  <enumValues>
    <name>СчитывательRFID</name>
    <comment>RFID</comment>
  </enumValues>
</mdclass:Enum>

newwms_gift/src/CommonModules/ОборудованиеЧекопечатающиеУстройстваОбновление/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Добавляет в список поставляемые драйверы в составе конфигурации.
//
Процедура ОбновитьПоставляемыеДрайвера(ДрайвераОборудования) Экспорт
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ПринтерЧеков;
	Драйвер.ИмяДрайвера  = "Драйвер1СПринтерЧеков";
	Драйвер.Наименование = НСтр("ru = '1С:Принтер чеков'");
	Драйвер.ИдентификаторОбъекта = "ReceiptPrinterNative"; 
	Драйвер.ВерсияДрайвера = "3.1.4.6"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверАтолККТ54ФЗ";
	Драйвер.Наименование = НСтр("ru = 'АТОЛ:ККТ с передачей данных в ОФД (54-ФЗ)'");
	Драйвер.ИдентификаторОбъекта = "ATOL_KKM_1C82_54FZ"; 
	Драйвер.СнятСПоддержки = Истина;
	Драйвер.СпособПодключения = Перечисления.СпособПодключенияДрайвера.ИзИнформационнойБазы;
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверАтолККТ54ФЗ9X";
	Драйвер.Наименование = НСтр("ru = 'АТОЛ:ККТ с передачей данных в ОФД (54-ФЗ) 9.x'");
	Драйвер.ИдентификаторОбъекта = "ATOL_KKT_1C83_V9"; 
	Драйвер.СнятСПоддержки = Истина;
	Драйвер.СпособПодключения = Перечисления.СпособПодключенияДрайвера.ИзИнформационнойБазы;
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверАтолККТ54ФЗ10X";
	Драйвер.Наименование = НСтр("ru = 'АТОЛ:ККТ с передачей данных в ОФД (54-ФЗ) 10.x'");
	Драйвер.ИдентификаторОбъекта = "ATOL_KKT_1C83_V10"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверАТОЛККТ54ФЗ10XФФД12";
	Драйвер.Наименование = НСтр("ru = 'АТОЛ:ККТ с передачей данных в ОФД 10.Х (ФФД 1.2)'");
	Драйвер.ИдентификаторОбъекта = "ATOL_KKT_1C_V10"; 
	Драйвер.ВерсияДрайвера = "10.9.1.0"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверШтрихМККТ54ФЗ";
	Драйвер.Наименование = НСтр("ru = 'ШТРИХ-М:ККТ с передачей данных в ОФД (54-ФЗ) 4.14'");
	Драйвер.ИдентификаторОбъекта = "SMDrvFR1C22"; 
	Драйвер.СнятСПоддержки = Истина;
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверШтрихМККТ54ФЗ415";
	Драйвер.Наименование = НСтр("ru = 'ШТРИХ-М:ККТ с передачей данных в ОФД (54-ФЗ) 4.15'");
	Драйвер.ИдентификаторОбъекта = "SMDrvFR1C3"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверШтрихМККТ54ФЗ4ФФД12";
	Драйвер.Наименование = НСтр("ru = 'ШТРИХ-М:ККТ с передачей данных в ОФД (ФФД 1.2)'");
	Драйвер.ИдентификаторОбъекта = "SMDrvFR1C34"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверИскраККТ54ФЗ";
	Драйвер.Наименование = НСтр("ru = 'ИСКРА:ККТ с передачей данных в ОФД (54-ФЗ)'");
	Драйвер.ИдентификаторОбъекта = "IskraKKT"; 
	Драйвер.ВерсияДрайвера = "2.0.4.1"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверККСККТ54ФЗ";
	Драйвер.Наименование = НСтр("ru = 'ККС:ККТ с передачей данных в ОФД (54-ФЗ)'");
	Драйвер.ИдентификаторОбъекта = "Spark115F"; 
	Драйвер.ВерсияДрайвера = "1.0.0.1"; 
	Драйвер.СнятСПоддержки = Истина;
	Драйвер.СпособПодключения = Перечисления.СпособПодключенияДрайвера.ИзИнформационнойБазы;
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверККСККТ54ФЗ2Х";
	Драйвер.Наименование = НСтр("ru = 'ККС:ККТ с передачей данных в ОФД (54-ФЗ) 2.х'");
	Драйвер.ИдентификаторОбъекта = "Spark130"; 
	Драйвер.ВерсияДрайвера = "2.0.0.2"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверMSTARККТ54ФЗ";
	Драйвер.Наименование = НСтр("ru = 'MSTAR:ККТ с передачей данных в ОФД (54-ФЗ)'");
	Драйвер.ИдентификаторОбъекта = "AlfaFiscalPrinter"; 
	Драйвер.ВерсияДрайвера = "1.3.29"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверСчетмашККТ54ФЗ";
	Драйвер.Наименование = НСтр("ru = 'Счетмаш:ККТ с передачей данных в ОФД (54-ФЗ)'");
	Драйвер.ИдентификаторОбъекта = "fr_feliksrmf1c83"; 
	Драйвер.ВерсияДрайвера = "1.1.20.331"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверNEWTONККТ54ФЗ";
	Драйвер.Наименование = НСтр("ru = 'NEWTON:ККТ с передачей данных в ОФД (54-ФЗ)'");
	Драйвер.ИдентификаторОбъекта = "NewtonMicroFR54FZ"; 
	Драйвер.ВерсияДрайвера = "1.0.5.6"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверARSККТ54ФЗ";
	Драйвер.Наименование = НСтр("ru = 'ars:ККТ с передачей данных в ОФД (54-ФЗ)'");
	Драйвер.ИдентификаторОбъекта = "Ars1CFiscalDriver"; 
	Драйвер.ВерсияДрайвера = "1.0.9"; 
	Драйвер.СнятСПоддержки = Истина;
	Драйвер.СпособПодключения = Перечисления.СпособПодключенияДрайвера.ИзИнформационнойБазы;
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверДримкасККТ54ФЗ";
	Драйвер.Наименование = НСтр("ru = 'Дримкас:ККТ с передачей данных в ОФД Вики Принт (ФФД 1.2)'");
	Драйвер.ИдентификаторОбъекта = "VikiP"; 
	Драйвер.ВерсияДрайвера = "1.6.0.7"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверИнитпроККТ54ФЗ";
	Драйвер.Наименование = НСтр("ru = 'Инитпро:ККТ с передачей данных в ОФД (54-ФЗ)'");
	Драйвер.ИдентификаторОбъекта = "NKR_KKT"; 
	Драйвер.ВерсияДрайвера = "1.3.0.1"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверFITККТ54ФЗ";
	Драйвер.Наименование = НСтр("ru = 'FIT:ККТ с передачей данных в ОФД (54-ФЗ)'");
	Драйвер.ИдентификаторОбъекта = "FIT_KKT_1C83_V10"; 
	Драйвер.ВерсияДрайвера = "1.09"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверИнкотексККТ54ФЗ";
	Драйвер.Наименование = НСтр("ru = 'Инкотекс:ККТ с передачей данных в ОФД (54-ФЗ)'");
	Драйвер.ИдентификаторОбъекта = "INCOTEX_KKT"; 
	Драйвер.ВерсияДрайвера = "1.0"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверМЕБИУСККТ54ФЗ";
	Драйвер.Наименование = НСтр("ru = 'МЕБИУС:ККТ с передачей данных в ОФД (54-ФЗ)'");
	Драйвер.ИдентификаторОбъекта = "Moebius1C_NET"; 
	Драйвер.ВерсияДрайвера = "3.1.1.3"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверWNJIККТ54ФЗ";
	Драйвер.Наименование = НСтр("ru = 'WNJI:ККТ с передачей данных в ОФД (54-ФЗ)'");
	Драйвер.ИдентификаторОбъекта = "WnjiFiscalPrinter"; 
	Драйвер.ВерсияДрайвера = "1.3.30"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверКАСТОМФ54ФЗ";
	Драйвер.Наименование = НСтр("ru = 'КАСТОМ:ККТ с передачей данных в ОФД (54-ФЗ)'");
	Драйвер.ИдентификаторОбъекта = "q3xfru"; 
	Драйвер.ВерсияДрайвера = "1.94"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверВерсияТK1Ф54ФЗ";
	Драйвер.Наименование = НСтр("ru = 'Версия-Т:ККТ с передачей данных в ОФД (54-ФЗ)'");
	Драйвер.ИдентификаторОбъекта = "VT_KKT_V2"; 
	Драйвер.ВерсияДрайвера = "2.0.0.57"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверЭвоторККТ54ФЗ";
	Драйвер.Наименование = НСтр("ru = 'Эвотор:ККТ с передачей данных в ОФД (54-ФЗ)'");
	Драйвер.ИдентификаторОбъекта = "EvoKKMExtension33"; 
	Драйвер.ВерсияДрайвера = "1.4.0525.0941"; 
	
КонецПроцедуры

#КонецОбласти
